---
kind: property
id: P:Autodesk.Revit.DB.Events.ViewExportingEventArgs.ViewId
source: html/7dbf14b5-3001-86c5-a3ec-e492dd58c135.htm
---
# Autodesk.Revit.DB.Events.ViewExportingEventArgs.ViewId Property

Identifies the view about to be exported.

## Syntax (C#)
```csharp
public ElementId ViewId { get; }
```